start_command_response = "Привет 👋🏼, меня зовут Graddy!" \
                         "\n" \
                         "\n" \
                         "Я буду оповещать тебя о новых оценках и показывать уже выставленные оценки 😋\n" \
                         "\n" \
                         "Пропиши /help, чтобы увидеть список доступных команд." \
                         "\n" \
                         "\n" \
                         "Удачи и высокого GPA!"

updated_login_response = "Прекрасно, я обновил твой логин!"

updated_password_response = "Замечательно, я обновил твой пароль!"

unknown_command_response = "Прости, но я не знаю эту команду.\nВведи /help, чтобы увидеть список доступных команд."

help_command_response = "Доступные команды:" \
                        "\n" \
                        "\n" \
                        "1. /set_username - обновление логина" \
                        "\n" \
                        "2. /set_password - обновление пароля для входа в moodle" \
                        "\n" \
                        "3. /notify_grades - включение уведомлений о новых оценках" \
                        "\n" \
                        "4. /disable_notify - выключение уведомлений" \
                        "\n" \
                        "5. /my_grades - все оценки" \
                        "\n" \
                        "6. /feedback - сообщить о баге, предложить новый функционал" \
                        "\n" \
                        "7. /help - список всех доступных команд"

no_login_or_password_response = 'Пожалуйста укажи свой логин и пароль. \n \nВведи /help, чтобы увидеть команды ' \
                                'при помощи которых это можно сделать.'

checking_data_response = 'Один момент. Я проверю твои данные.'

wrong_moodle_data_response = 'Похоже у тебя нет курсов на текущий семестр, либо ты ввел неправильный логин или ' \
                             'пароль. Попробуй обновить их и попробовать снова.'

successful_moodle_login_response = 'Замечательно! Теперь я буду уведомлять тебя о новых оценках!'

set_username_response = 'Хорошо, приятель, какой у тебя логин для входа в moodle? \n\nВведи /cancel, если вызвал ' \
                        'команду по ошибке.'

set_password_response = 'Введи пароль, который ты используешь для входа в moodle. Все пароли надежно шифруются, ' \
                        'поэтому можешь не беспокоится за их сохранность.\n\nВведи /cancel, если вызвал команду ' \
                        'по ошибке.'

feedback_command_response = 'Напишите Ваш отзыв, мы обязательно его прочтем 👻\n\nПропишите /cancel, если вызвали ' \
                            'команду по ошибке.'

already_notifying_response = 'Вы и так подписаны 😸'

already_not_notifying_response = 'Вы и так не подписаны 🙂'

password_changed_response = 'Похоже ты поменял пароль. Если да, то пожалуйста вызови /set_main_password, а ' \
                            'после /notify_grades.'

command_cancel_response = 'Команда отменена 😌'

disable_notifying_response = 'Больше не буду уведмолять тебя 🙂'

feedback_sent_response = 'Ваш отзыв отправлен! Спасибо за обратную связь 😉'
